# データの前処理

### CSV形式のファイルからサンプルデータを作ってみる

### かつ、欠損値データをカウントする

In [4]:
import pandas as pd
from io import StringIO

csv_data = """
A,B,C,D
1.0,2.0,3.0,4.0
5.0,6.0,,8.0
10.0,11.0,12.0,
"""

df = pd.read_csv(StringIO(csv_data))

StringIOなしで実行してみると違いがわかる

In [3]:
df

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

In [5]:
# 各特徴量の欠損値をカウント
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False  False   True  False
2  False  False  False   True

In [7]:
df.isnull().sum()

A    0
B    0
C    1
D    1
dtype: int64

### 欠損値を取り除く

In [8]:
df.dropna()

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [9]:
df.dropna(axis=1)

      A     B
0   1.0   2.0
1   5.0   6.0
2  10.0  11.0

In [10]:
# 全ての列がNaN、である行を削除
df.dropna(how='all')

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

In [14]:
# NaNではない値が4つ未満の行を削除
df.dropna(thresh=4)

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [15]:
# 特定の列にNaNが含まれていれば、その行を削除
df.dropna(subset=['D'])

     A    B    C    D
0  1.0  2.0  3.0  4.0
1  5.0  6.0  NaN  8.0

### 欠損値を補完する